In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
import database

In [4]:
db_conn = database.CustomDbConnector()

You are connected to the database: mongo?authSource=admin
-----------------------------------------------

## Part 1, import

In [5]:
import importer

In [6]:
imprt = importer.Importer(db_conn.db)

In [7]:
imprt.import_with_backreferences()

----------------------Starting import_with_backreferences-----------------------
----------------Finished import_with_backreferences in 9.421 ms-----------------

/Users/larswaage/Code/large-distributed-data/src/mongodb/importer.py:227: UserWarning: Already imported, run `wipe_collections` and try again
  warnings.warn("Already imported, run `wipe_collections` and try again")

### Samples

In [8]:
imprt.user_sample()

   _id  has_labels                                         activities
0    0       False  [6524153b0e7301b587d1811c, 6524153c0e7301b587d...
1    1       False  [6524153c0e7301b587d181b7, 6524153c0e7301b587d...
2    2       False  [6524153c0e7301b587d181f0, 6524153c0e7301b587d...
3    3       False  [6524153c0e7301b587d18282, 6524153c0e7301b587d...
4    4       False  [6524153d0e7301b587d18387, 6524153d0e7301b587d...
5    5       False  [6524153d0e7301b587d184e1, 6524153d0e7301b587d...
6    6       False  [6524153d0e7301b587d1852a, 6524153d0e7301b587d...
7    7       False  [6524153d0e7301b587d18542, 6524153d0e7301b587d...
8    8       False  [6524153e0e7301b587d1856a, 6524153e0e7301b587d...
9    9       False  [6524153e0e7301b587d18581, 6524153e0e7301b587d...

In [9]:
imprt.activity_sample()

,_id,user_id,start_datetime,end_datetime,transportation_mode,track_points
0,6524153b0e7301b587d1811c,0,2009-04-12 07:33:03,2009-04-12 17:24:59,,"[652415630e7301b587d1bfcc, 652415630e7301b587d..."
1,6524153c0e7301b587d1811d,0,2009-05-10 02:02:06,2009-05-10 06:20:11,,"[652415630e7301b587d1c6a6, 652415630e7301b587d..."
2,6524153c0e7301b587d1811e,0,2008-12-01 11:18:27,2008-12-01 11:35:15,,"[652415630e7301b587d1c9d7, 652415630e7301b587d..."
3,6524153c0e7301b587d1811f,0,2009-06-21 10:14:07,2009-06-21 14:47:12,,"[652415630e7301b587d1ca8e, 652415630e7301b587d..."
4,6524153c0e7301b587d18120,0,2008-12-11 12:14:32,2008-12-11 12:24:32,,"[652415630e7301b587d1d1d6, 652415630e7301b587d..."
5,6524153c0e7301b587d18121,0,2009-06-29 01:16:30,2009-06-29 11:13:12,,"[652415630e7301b587d1d24f, 652415630e7301b587d..."
6,6524153c0e7301b587d18122,0,2009-05-09 18:16:36,2009-05-09 18:30:36,,"[652415630e7301b587d1da11, 652415630e7301b587d..."
7,6524153c0e7301b587d18123,0,2009-07-03 00:28:00,2009-07-03 08:37:23,,"[652415630e7301b587d1dabe, 652415630e7301b587d..."
8,6524153c0e7301b587d18124,0,2009-06-07 07:52:55,2009-06-07 09:46:03,,"[652415630e7301b587d1e1ba, 652415630e7301b587d..."
9,6524153c0e7301b587d18125,0,2009-06-11 22:12:04,2009-06-11 22:34:54,,"[652415630e7301b587d1e440, 652415630e7301b587d..."

In [10]:
imprt.track_point_sample()

,_id,datetime,latitude,longitude,altitude,activity_id
0,652415630e7301b587d1bfcc,2009-04-12 07:33:03,40.000017,116.327479,105.0,6524153b0e7301b587d1811c
1,652415630e7301b587d1bfcd,2009-04-12 07:33:09,40.000168,116.327474,80.0,6524153b0e7301b587d1811c
2,652415630e7301b587d1bfce,2009-04-12 07:33:14,40.000055,116.327454,99.0,6524153b0e7301b587d1811c
3,652415630e7301b587d1bfcf,2009-04-12 07:33:19,40.000021,116.327407,109.0,6524153b0e7301b587d1811c
4,652415630e7301b587d1bfd0,2009-04-12 07:33:24,40.000035,116.327281,111.0,6524153b0e7301b587d1811c
5,652415630e7301b587d1bfd1,2009-04-12 07:33:29,39.999983,116.327285,114.0,6524153b0e7301b587d1811c
6,652415630e7301b587d1bfd2,2009-04-12 07:33:34,39.999853,116.327267,120.0,6524153b0e7301b587d1811c
7,652415630e7301b587d1bfd3,2009-04-12 07:33:39,39.999745,116.327165,125.0,6524153b0e7301b587d1811c
8,652415630e7301b587d1bfd4,2009-04-12 07:33:44,39.999661,116.326997,126.0,6524153b0e7301b587d1811c
9,652415630e7301b587d1bfd5,2009-04-12 07:33:49,39.999528,116.326873,127.0,6524153b0e7301b587d1811c

## Part 2, tasks

### Setup

In [11]:
import tasks
task = tasks.Task(db_conn.db)

### Task 1

In [12]:
t1 = task.task1()
t1

---------------------------------Starting task1---------------------------------
-------------------------Finished task1 in 1636.533 ms--------------------------

   # users  # activities  # track points
0      182         16048         9681756

### Task 2

In [13]:
t2 = task.task2()
t2

---------------------------------Starting task2---------------------------------
---------------------------Finished task2 in 3.341 ms---------------------------

   min_activity_count  max_activity_count  avg_activity_count
0                   0                2102           88.175824

### Task 3

In [14]:
t3 = task.task3()
t3

---------------------------------Starting task3---------------------------------
---------------------------Finished task3 in 2.941 ms---------------------------

    _id  activity_count
0   128            2102
1   153            1793
2    25             715
3   163             704
4    62             691
5   144             563
6    41             399
7    85             364
8     4             346
9   140             345
10  167             320
11   68             280
12   17             265
13    3             261
14   14             236
15  126             215
16   30             210
17  112             208
18   11             201
19   39             198

### Task 4

In [15]:
t4 = task.task4()
t4

---------------------------------Starting task4---------------------------------
---------------------------Finished task4 in 5.892 ms---------------------------

   Users Who Have Taken a Taxi
0                           10
1                           58
2                           62
3                           78
4                           80
5                           85
6                           98
7                          111
8                          128
9                          163

### Task 5

In [16]:
t5 = task.task5()
t5

---------------------------------Starting task5---------------------------------
---------------------------Finished task5 in 6.231 ms---------------------------

        _id  transportation_mode_count
0      walk                        481
1       car                        419
2      bike                        262
3       bus                        199
4    subway                        133
5      taxi                         37
6  airplane                          3
7     train                          2
8      boat                          1
9       run                          1

### Task 11

In [21]:
t11 = task.task11()
t11

--------------------------------Starting task11---------------------------------
--------------------------Finished task11 in 16.713 ms--------------------------

    _id transportation_mode  transportation_mode_count
0    10                taxi                          3
1    20                walk                         80
2    21                walk                          1
3    52                 bus                          1
4    56                bike                         15
5    58                walk                          2
6    60                walk                          1
7    62                walk                        173
8    64                bike                          1
9    65                walk                         10
10   67                walk                          1
11   69                bike                          1
12   73                walk                         52
13   75                walk                          1
14   76                 car                          3
15   78                walk                         37
16   80                taxi                          1
17   81                walk                          4
18   82                walk                          2
19   84                walk                          9
20   85                walk                         18
21   86                walk                          2
22   87                walk                          5
23   89                walk                          7
24   91                walk                          2
25   92                walk                          1
26   97                bike                          9
27   98                taxi                          1
28  101                 car                          3
29  102                walk                          7
30  107                walk                          1
31  108                walk                          2
32  111                taxi                          3
33  112                walk                         69
34  115                walk                         80
35  117                walk                          1
36  125                 bus                          3
37  126                walk                         13
38  128                walk                        312
39  136                walk                          3
40  138                bike                          2
41  139                walk                          4
42  144                walk                          2
43  153                walk                          5
44  161                walk                          1
45  163                walk                         26
46  167                walk                         31
47  175                 bus                          1